In [4]:
# 数据规整化：清理、转换、合并和重塑

In [3]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [5]:
# 数据库风格的DataFrame合并

In [6]:
df1 = DataFrame({
    'key': list('bbacaab'),
    'data1': range(7)
})

In [7]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [8]:
df2 = DataFrame({
    'key': list('abd'),
    'data2': range(3)
})

In [9]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [10]:
pd.merge(df1, df2)

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [11]:
pd.merge(df1, df2, on='key')

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [18]:
df3 = DataFrame({
    'lkey': list('bbacaab'),
    'data1': range(7)
})

In [21]:
df4 = DataFrame({
    'rkey': list('abd'),
    'data2': range(3)
})

In [19]:
df3

   data1 lkey
0      0    b
1      1    b
2      2    a
3      3    c
4      4    a
5      5    a
6      6    b

In [22]:
df4

   data2 rkey
0      0    a
1      1    b
2      2    d

In [25]:
# 默认情况下，merge做的试“inner”连接；其他还有“left”，”right"以及“outer"连接
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

   data1 lkey  data2 rkey
0      0    b      1    b
1      1    b      1    b
2      6    b      1    b
3      2    a      0    a
4      4    a      0    a
5      5    a      0    a

In [26]:
pd.merge(df1, df2, how='outer')

   data1 key  data2
0    0.0   b    1.0
1    1.0   b    1.0
2    6.0   b    1.0
3    2.0   a    0.0
4    4.0   a    0.0
5    5.0   a    0.0
6    3.0   c    NaN
7    NaN   d    2.0

In [27]:
df1 = DataFrame({
    'key': list('bbacab'),
    'data1': range(6)
})

In [28]:
df2 = DataFrame({
    'key': list('ababd'),
    'data2': range(5)
})

In [29]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [30]:
df2

   data2 key
0      0   a
1      1   b
2      2   a
3      3   b
4      4   d

In [31]:
pd.merge(df1, df2, on='key', how='left')

    data1 key  data2
0       0   b    1.0
1       0   b    3.0
2       1   b    1.0
3       1   b    3.0
4       2   a    0.0
5       2   a    2.0
6       3   c    NaN
7       4   a    0.0
8       4   a    2.0
9       5   b    1.0
10      5   b    3.0

In [32]:
pd.merge(df1, df2, how='inner')

   data1 key  data2
0      0   b      1
1      0   b      3
2      1   b      1
3      1   b      3
4      5   b      1
5      5   b      3
6      2   a      0
7      2   a      2
8      4   a      0
9      4   a      2